app/controllers/application_controller.rb

  def switch_locale
    locale = params[:locale]
    if I18n.available_locales.include?(locale.to_sym)
      session[:locale] = locale
      # Store in user profile if logged in
      current_user.update(locale: locale) if user_signed_in? && current_user.respond_to?(:locale)
---
UPDATE "users" SET "updated_at" = '2025-09-15 02:17:28.625304', "locale" = 'ja' WHERE "users"."id" = 1