app/controllers/print_pricings_controller.rb

SELECT "print_pricings".* FROM "print_pricings" WHERE "print_pricings"."user_id" = 1 ORDER BY "print_pricings"."created_at" DESC
---
  def index
    @print_pricings = current_user.print_pricings.order(created_at: :desc)

INSERT INTO "print_pricings" ("user_id", "job_name", "printing_time_hours", "printing_time_minutes", "filament_weight", "filament_type", "spool_price", "spool_weight", "markup_percentage", "prep_time_minutes", "prep_cost_per_hour", "postprocessing_time_minutes", "postprocessing_cost_per_hour", "other_costs", "vat_percentage", "final_price", "created_at", "updated_at", "printer_id") VALUES (1, 'Ako Topo Map', 2, 30, 37.0, 'PLA', 3000.0, 1000.0, 20.0, 15, 1500.0, 15, 1500.0, NULL, 10.0, 1071.22319634703196347031963470319634, '2025-09-09 01:44:46.079806', '2025-09-09 01:44:46.079806', 1) RETURNING "id"
---
  def create
    @print_pricing = current_user.print_pricings.build(print_pricing_params)

    if params[:print_pricing][:start_with_one_print] == "1"
      @print_pricing.times_printed = 1
    end

    if @print_pricing.save

UPDATE "print_pricings" SET "spool_price" = 2800.0, "final_price" = 1061.45519634703196347031963470319634, "updated_at" = '2025-09-09 02:43:11.221688' WHERE "print_pricings"."id" = 1
---
  def update
    if @print_pricing.update(print_pricing_params)

UPDATE "print_pricings" SET "updated_at" = '2025-09-15 23:17:28.892572', "times_printed" = 1 WHERE "print_pricings"."id" = 5
---
  def increment_times_printed
    @print_pricing.increment_times_printed!

UPDATE "print_pricings" SET "updated_at" = '2025-09-18 00:55:38.736777', "times_printed" = 1 WHERE "print_pricings"."id" = 5
---
  def decrement_times_printed
    @print_pricing.decrement_times_printed!

SELECT "print_pricings".* FROM "print_pricings" WHERE "print_pricings"."user_id" = 1 AND "print_pricings"."id" = 5 LIMIT 1
---
  def set_print_pricing
    @print_pricing = current_user.print_pricings.find(params[:id])