app/controllers/printers_controller.rb

SELECT "printers".* FROM "printers" WHERE "printers"."user_id" = 1 ORDER BY "printers"."name" ASC
---
  def index
    @printers = current_user.printers.order(:name)

INSERT INTO "printers" ("user_id", "name", "manufacturer", "power_consumption", "cost", "payoff_goal_years", "date_added", "created_at", "updated_at", "daily_usage_hours", "investment_return_years", "repair_cost_percentage") VALUES (1, 'K2 Plus', 'Creality', 1200.0, 2000.0, 3, '2025-09-09 00:09:51.735306', '2025-09-09 00:09:51.736288', '2025-09-09 00:09:51.736288', 6, 3, 5.0) RETURNING "id", "date_added"
---
  def create
    @printer = current_user.printers.build(printer_params)

    if @printer.save

SELECT "printers".* FROM "printers" WHERE "printers"."user_id" = 1 AND "printers"."id" = 1 LIMIT 1
---
  def set_printer
    @printer = current_user.printers.includes(:print_pricings).find(params[:id])