app/controllers/printers_controller.rb

INSERT INTO "printers" ("user_id", "name", "manufacturer", "power_consumption", "cost", "payoff_goal_years", "date_added", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id", "date_added"
---
  def create
    @printer = current_user.printers.build(printer_params)

    if @printer.save

UPDATE "printers" SET "name" = $1, "power_consumption" = $2, "updated_at" = $3 WHERE "printers"."id" = $4  [["name", "Updated Printer Name"], ["power_consumption", "250.0"], ["updated_at", "2025-09-08 06:28:35.537889"], ["id", 980190962]]
---
  def update
    if @printer.update(printer_params)

DELETE FROM "printers" WHERE "printers"."id" = $1  [["id", 980190962]]
---
  def destroy
    @printer.destroy

SELECT "print_pricings".* FROM "print_pricings" WHERE "print_pricings"."user_id" = $1 AND "print_pricings"."id" = $2 LIMIT $3  [["user_id", 980190962], ["id", 980190964], ["LIMIT", 1]]
SELECT "printers".* FROM "printers" WHERE "printers"."user_id" = $1 AND "printers"."id" = $2 LIMIT $3  [["user_id", 980190962], ["id", 980190962], ["LIMIT", 1]]
---
  def set_printer
    @printer = current_user.printers.includes(:print_pricings).find(params[:id])