app/controllers/print_pricings_controller.rb

INSERT INTO "print_pricings" ("user_id", "job_name", "currency", "printing_time_hours", "printing_time_minutes", "filament_weight", "filament_type", "spool_price", "spool_weight", "markup_percentage", "power_consumption", "energy_cost_per_kwh", "prep_time_minutes", "prep_cost_per_hour", "postprocessing_time_minutes", "postprocessing_cost_per_hour", "printer_cost", "investment_return_years", "daily_usage_hours", "repair_cost_percentage", "other_costs", "vat_percentage", "final_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25) RETURNING "id"
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "default_currency", "default_energy_cost_per_kwh") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @print_pricing = current_user.print_pricings.build(print_pricing_params)

    if params[:print_pricing][:start_with_one_print] == "1"
      @print_pricing.times_printed = 1
    end

    if @print_pricing.save

UPDATE "print_pricings" SET "job_name" = $1, "currency" = $2, "final_price" = $3, "updated_at" = $4 WHERE "print_pricings"."id" = $5  [["job_name", "Updated Job Name"], ["currency", "GBP"], ["final_price", "1.716"], ["updated_at", "2025-09-08 02:54:40.129198"], ["id", 980190962]]
---
  def update
    if @print_pricing.update(print_pricing_params)

DELETE FROM "print_pricings" WHERE "print_pricings"."id" = $1  [["id", 980190962]]
---
  def destroy
    @print_pricing.destroy

SELECT "print_pricings".* FROM "print_pricings" WHERE "print_pricings"."user_id" = $1 AND "print_pricings"."id" = $2 LIMIT $3  [["user_id", 980190962], ["id", 980190964], ["LIMIT", 1]]
---
  def set_print_pricing
    @print_pricing = current_user.print_pricings.find(params[:id])