app/controllers/user_profiles_controller.rb

  def update
    @user = current_user

    if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = '2025-09-08 23:56:48.424377', "default_currency" = 'JPY', "default_energy_cost_per_kwh" = 0.3 WHERE "users"."id" = 1