app/views/print_pricings/edit.html.erb

      <div class="field-group">
        <label for="printer"><%= t('print_pricing.fields.select_printer') %></label>
        <%= form.select :printer_id,
            options_from_collection_for_select(current_user.printers, :id, :name, @print_pricing.printer_id),
            { prompt: t('print_pricing.fields.select_printer_prompt') },
            { id: "printer-select" } %>
---
SELECT "print_pricings".* FROM "print_pricings" WHERE "print_pricings"."printer_id" = $1  [["printer_id", 980190965]]
SELECT "printers".* FROM "printers" WHERE "printers"."user_id" = $1  [["user_id", 980190965]]