app/views/print_pricings/edit.html.erb

        <label for="printer"><%= t('print_pricing.fields.select_printer') %></label>
        <%= form.select :printer_id,
            options_from_collection_for_select(current_user.printers, :id, :name, @print_pricing.printer_id),
            { prompt: t('print_pricing.fields.select_printer_prompt') },
            { id: "printer-select" } %>
---
SELECT "print_pricings".* FROM "print_pricings" WHERE "print_pricings"."user_id" = 1 AND "print_pricings"."id" = 1 LIMIT 1