app/views/print_pricings/index.html.erb

INSERT INTO "print_pricings" ("user_id", "job_name", "printing_time_hours", "printing_time_minutes", "filament_weight", "filament_type", "spool_price", "spool_weight", "markup_percentage", "prep_time_minutes", "prep_cost_per_hour", "postprocessing_time_minutes", "postprocessing_cost_per_hour", "other_costs", "vat_percentage", "final_price", "created_at", "updated_at", "printer_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19) RETURNING "id"
---
  </p>
  <%= link_to t('print_pricing.index.create_new'), new_print_pricing_path, class: "button", style: "font-size: 1.1rem; padding: 1rem 2rem;" %>