app/views/print_pricings/new.html.erb

    <div class="error-messages">
      <h3><%= t('common.errors_prohibited', count: @print_pricing.errors.count, errors: t('common.error_count', count: @print_pricing.errors.count), model: t('models.print_pricing')) %></h3>
---
SELECT COUNT(*) FROM "print_pricings"

        <label for="printer"><%= t('print_pricing.fields.select_printer') %></label>
        <%= form.select :printer_id,
            options_from_collection_for_select(current_user.printers, :id, :name, @print_pricing.printer_id),
            { prompt: t('print_pricing.fields.select_printer_prompt') },
            { id: "printer-select" } %>
---
SELECT "print_pricings".* FROM "print_pricings" WHERE "print_pricings"."user_id" = $1 AND "print_pricings"."id" = $2 LIMIT $3  [["user_id", 980190962], ["id", 980190962], ["LIMIT", 1]]