app/views/print_pricings/show.html.erb

  <%= link_to new_print_pricing_path, class: "btn btn-primary" do %>
    <span><%= t('print_pricing.create_new') %></span>
---
INSERT INTO "print_pricings" ("user_id", "job_name", "currency", "printing_time_hours", "printing_time_minutes", "filament_weight", "filament_type", "spool_price", "spool_weight", "markup_percentage", "power_consumption", "energy_cost_per_kwh", "prep_time_minutes", "prep_cost_per_hour", "postprocessing_time_minutes", "postprocessing_cost_per_hour", "printer_cost", "investment_return_years", "daily_usage_hours", "repair_cost_percentage", "other_costs", "vat_percentage", "final_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25) RETURNING "id"